Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: The main approach to decentralized control on the basis of the theory of supervisory control is the conjunctive architecture of local supervisors when global permitted events are the only ones which were allowed by each of the local supervisors.
ru: Основной подход к построению децентрализованного управления на основе теории супервизорного управления - это комплексирование локальных супервизоров, когда разрешены только события, которые допущены каждым из локальных супервизоров.

source: The manufacturing process naturally is being under impact of various uncertainties (perturbations) such as delay of resource supply, the equipment breakdown, temporal lack of labor, sudden production need, requiring equipment occupation on the urgent tasks, etc.
ru: Производственный процесс, естественно, находится под влиянием различных факторов неопределенности (возмущений) таких, как задержка поставок ресурсов, отказ оборудования, временное отсутствие работников, производственная необходимость, требующая использование оборудования для решения более срочных задач и т.д.

source: The markup for the documents is a part of our LOD based service providing integration with other NGS Internet resources.
ru: Разметка документов является частью нашей службы на основе LOD, обеспечивающей интеграцию с другими Интернет-ресурсами NGS.

source: The means of such control is the supervisor.
ru: Такое управление называется супервизорным.

source: The metacharacters (.
ru: Метасимволы (.

source: The metadata are stored for main input data of MiSeq SOP and transformed with each application of commands into metadata describing command output objects.
ru: Метаданные сохраняются для основных входных данных MiSeq SOP и преобразуются при каждом применении команд в метаданные, описывающие объектов их выводных данных.

source: The method allows one to describe a significant number of new groups of organisms at all taxonomic levels.
ru: Метод позволяет описать значительное количество новых групп организмов на всех таксономических уровнях.

source: The method of telephone wires often confuses people because given the name, you would assume that only telephone signals can be sent through telephone wires.
ru: Передача интернета "по проводам" часто сбивает людей с толку, потому что, исходя из названия, можно предположить, что только телефонные сигналы могут передаваться по телефонным проводам.

source: The middle entry “enx000f00de66da” is what we are interested in, because it displays the IP address of this device, the subnet mask, and the broadcast address of my LAN.
ru: Средняя запись «enx000f00de66da» отображает IP-адрес устройства, подключенного к маршрутизатору (локальной сети), маску подсети и широковещательный адрес этой сети.

source: The model and its comprising structures are identified globally as resources.
ru: Модель и составляющие ее структуры идентифицируются глобально как ресурсы.

source: The model is constructed by a Prolog inference machine with respect to the information describing the forest resources condition.
ru: Модель строится при помощи логического вывода в языке Prolog в зависимости от имеющейся информации о состоянии лесных ресурсов региона.

source: The modem takes that analog signal, converts it to a digital signal, and sends it over to the router.
ru: Модем принимает аналоговый сигнал, преобразует его в цифровой и отправляет на маршрутизатор.

source: The more general approach is implemented in Stratego/XT framework for domain specific languages’ development.
ru: Более общий подход реализуется в рамках проекта Stratego/XT, направленного на развитие средств реализации языков предметной области.

source: The most basic form of a scripting file is shown below.
ru: Самая простая форма файла сценария показана ниже.

source: The most important global environment variable that you must set is the PATH variable.
ru: Самая важная глобальная переменная среды, которую очень часто устанавливают, - это переменная PATH.

source: The network is designed with Rapidminer studio as a dataflow.
ru: Сеть разработана с использованием Rapidminer studio в качестве редактора потока данных (dataflow).

source: The network itself has an IP address which is called the “default gateway”.
ru: Сеть имеет IP-адрес, который называется «шлюзом по умолчанию».

source: The network of modules is constructed on the base of a MiSeq SOP model, where each module is a module of Mothur package.
ru: Сеть модулей построена на основе модели MiSeq SOP, где каждый узел является модулем пакета Mothur.

source: The nowadays OMG standards describe specifications of converting relational, UML, SysML metadata to RDF representation.
ru: Современные стандарты OMG описывают спецификации преобразования реляционных метаданных UML, SysML в представление RDF.

source: The number of scientific problems is being increased too.
ru: Увеличивается и количество научных проблем.

source: The number of the trajectories can be constructed, e.g., movement of the group in a conserved formation along a prescribed trajectory, patrolling a water area with gateways.
ru: Можно строить одновременно несколько траекторий одновременно, например, для представления движения группы аппаратов в заданной формации вдоль заданной траектории, патрулирование акватории со шлюзами.

source: The objects are represented in the Logtalk programming language.
ru: Объекты представлены в языке программирования Logtalk.

source: The obtained data is useful as heuristic for reduction of the number sybsystem combinations needed in the modular supervisor synthesis.
ru: Полученные данные полезны в качестве эвристик для сокращения количества комбинаций подсистем, необходимых в синтезе модульного супервизора.

source: The one we will look at is the “Host: www.thediygolfer.com" line.
ru: Посмотрим на строку “Host: www.thediygolfer.com".

source: The only problem we face now is that the regular expressions are still matching the first part of the “bob879@yahoo.com.yahoo.com“.
ru: Единственная проблема, котрая еще не решена заключается в том, что регулярные выражения по-прежнему соответствуют первой части “bob879@yahoo.com.yahoo.com“.

source: The output of this is below.
ru: Результат запуска показан ниже.

source: The packets will be delivered to my router, but how does my router know where my computer is?
ru: Пакеты будут доставлены на домашний маршрутизатор, но как маршрутизатор узнает, где находится компьютер?

source: The paper also has a good review of Linux virtual machine cloud distributions and bioinformatic packages.
ru: В статье есть также есть хороший обзор дистрибутивов виртуальных машин Linux для организации облачных сервисов и биоинформатических пакетов.

source: The paper has very good review of existing commercial and open-source platforms allowing construction of pipelines of computing processes.
ru: В статье содержится очень хороший обзор существующих коммерческих платформ и платформ с открытым исходным кодом, позволяющих создавать конвейеры вычислительных процессов.

source: The permissions on this file are 744, which means that only we (the owner of the script) can modify or execute it.
ru: Разрешения на этот файл - 744, что означает, что только владелец скрипта может его изменять или выполнять.

source: The practical results having novelty will be the intelligent software enabling one to describe near-to-real (system scale) manufacturing process, define the properties of the competitive environments and other parameters.
ru: Новыми результатами в практическом аспекте будут интеллектное программное обеспечение, позволяющее описывать производственные процессы, близком к реальному масштабу, определять свойства среды куонкурентных агентов и других параметров.

source: The present research results for resource-driven games (RDG) is presented with mathematical structures (multisets), operations over them and ways of the game definitions.
ru: Результаты предлагаемого научного исследования в области ресурсно-управляемых игр (РУИ) представляются математическими структурами (мультимножествами), операциями над ними и способы определения правил игры.

source: The priority is calculated by special trajectory evaluation routines.
ru: Приоритет рассчитывается в результате анализа получающихся траекторий процедурой оценки.

source: The problem is… We failed to match all those words and letters in the middle.
ru: Проблема в том, что сопоставление слов (букв) в центре строки не сделано.

source: The problem of designing a proper supervisor for fully or partially observed DES is the main problem of supervisory control theory (SCT).
ru: Проблема разработки соответствующего супервизора полностью- или частично-наблюдаемых ДСС - главная проблема теории супервизорного управления (ТСУ).

source: The problem set to be solved includes optimization of the utilization of cluster computing resources, planning parallel computing executions based on process structure analysis and the properties of algorithms that implement specific operations, and implementation of the control points for services.
ru: Набор задач, требующих решения, включает оптимизацию использования вычислительных ресурсов кластера, планирование выполнения параллельных вычислений на основе анализа структуры процесса и свойств алгоритмов, реализующих определенные операции, а также реализацию контрольных точек для служб.

source: The process is an instance of batch processing, which is a combination of operations which have to be conducted to analyze one set of substances.
ru: Данные процессы являются примерами "серийного производства" (batch processing), состоящей из совокупности операций, направленных на анализ одиного набора веществ.

source: The process of connecting to a VPS works in the following steps.
ru: Процесс подключения к VPS состоит из следующих шагов.

source: The project research is directed to solving the fundamental problems of intelligent control synthesis for RDDESU on the basis of
ru: Исследовательский проект направлен на решение фундаментальной проблемы интеллектуального синтеза управления для РУДССН на основе

source: The proposed research is based on the complex representation of sociotechnical system as RDDESU, accounting more information for the object representation as compared to the approaches based on GT and DES, resulting in more adequate real technical systems modeling with its environment, usually competitive for resources.
ru: Предлагаемое исследование базируется на комплексном представлении социотехнических систем в виде РУДССН, что позволяет учитывать в модели дополнительную информацию, по сравнению с подходами, основанными на ТИ и ДСС, в результате получаются средства моделирования, более адекватные реальным техническими системам, находящихся в среде агентов, как правило, конкурирующих за ресурсы.

source: The real question is… How does the router know where this request needs to go?
ru: Настоящий вопрос: как маршрутизатор узнает, куда должен идти этот запрос?

source: The reason I did not cover this topic is because this topic is far more useful if you are using a programming language like Python for regular expressions because with such a language, you can refer to different groups of your regular expression later in your code.
ru: Причина, по которой мы не затрагивали эту тему, заключается в том, что эта тема гораздо более полезна в программах обычных языков программирования, таких как Python. В программах, использующих регулярные выражения, можно ссылаться на разные группы регулярных выражений, после получаения удачного соответствия.

source: The reason I skipped over these is because when we use them, all the rules change.
ru: Они пропущены потому, что при их использовании, меняется поведение правил.

source: The reason is because they are background processes.
ru: Причина в том, что они являются фоновыми процессами.

source: The reason these two commands are contested frequently is due to the better alternatives that we have today.
ru: Причина стосторит в том, что сейчас существуют лучшие альтернативы.

source: The reason these utilities are highly contentious is because anything you can do in sed or awk can be done in Perl or Python in a simpler manner.
ru: Проблема с этими программами заключается в том, что все, что можно сделать, комбинируя sed или awk, можно реализовать в языках Perl или Python в более простой.

source: The reason this isn’t working is because we have not specified how many characters we want to match between the literal word “You” and the literal word “is!”.
ru: Причина, по которой это не работает, заключается в том, что количество символов в центре не указано, т.е., то, что между "You" и "is!".

source: The reason we have subnet masks is to conserve the address space used by a single network.
ru: Маски подсети используются для экономии адресного пространства, используемого одной сетью.

source: The reference [3] reviewed the problem area, described the existing approaches and services already made, but has no mentions of the implemented cloud computing environments.
ru: В справочнике [3] рассмотрена проблемная область, описаны существующие подходы и уже реализованные услуги, но не упоминаются реализованные среды облачных вычислений.

source: The remainder of this section will walk through a practical example using our newfound regexp skills.
ru: В оставшейся части этого раздела рассмотрим практический пример использования новых навыков составлений регулярного выражения.

source: The remove.seqs command takes a list of sequence names and either a fastq, fasta, name, group, list, count or align.report file to generate a new file that does not contain the sequences in the list.
ru: Команда ```remove.seqs``` принимает список названий последовательностей и один из файлов fastq, fasta, name, group, list, count или align.report, затем генерирует новый файл, который не будет содержать последовательности из списка имен.

source: The resource reallocation is started as soon as an existing computation process fails.
ru: Перераспределение вычислительных ресурсов происходит как только существующий вычислительный процесс останавливается вследствие сбоя.

source: The resulting inferences can have intuitionistic semantic if some general constraints on the whole formula are hold.
ru: Полученные выводы могут иметь интуиционистскую семантику, если выполняются специальные ограничения на структуру формулы.

source: The results of the parallel processing, then, joined (reduced) to an aggregative object.
ru: Затем результаты параллельной обработки объединяются в агрегированный объект.

source: The review of papers shows that as of to date there are two open-source projects related to automation of NGS data analysis being in active development: Galaxy and UGENE.
ru: Обзор статей показывает, что в настоящее время в активной разработке находятся два open-source проекта, связанных с автоматизацией анализа данных NGS: Galaxy и UGENE.

source: The router represents a “local network”, and actually has a dynamic IP address (DHCP) that will change from time to time.
ru: Маршрутизатор представляет собой «локальную сеть» и фактически имеет динамический внешний IP-адрес (DHCP), который время от времени меняться провайдером.

source: The router will now figure out the quickest path to this location and send off the request packet.
ru: Маршрутизатор рассчитает самый быстрый путь до цели и перешлет пакет запроса в соответствующем направлении.

source: The same command we just wrote about can be modified and written like so:
ru: Теперь то, что мы делали выше, можно сделать по-другому:

source: The same concepts apply no matter what website you visit, but keeping things as simple as possible is key to understanding.
ru: Эти же концепции применимы независимо от того, какой веб-сайт вы посещаете, но будем следовать правилу "как можно проще".

source: The same technique is used in (R.A.
ru: Такой же метод используется в (R.A.

source: The scenarios were calculated with model of the forest dynamics.
ru: Сценарии рассчитываются при помощи моделей динамики развития леса.

source: The scenarios, which do not comply the constraints are rejected.
ru: Сценарии, в котором ограничения не выполняются, уничтожается.

source: The scheme represents the applied modules to be run and their relationships.
ru: Схема представляет собой прикладные модули и отношения предшествования во время выполнения.

source: The scientific novelty is justified the usage of data close to real, application of the transformational technologies in software that allow one to deal with more complex models and account more data.
ru: Научная новизна обосновывается использованием приближенных к реальным данных, применением программного обеспечения для трансформации моделей, которые позволяют исследовать комплексные модели и учитывать больше входных данных.

source: The screen.seqs command enables you to keep sequences that fulfill certain user defined criteria.
ru: Команда ```screen.seqs``` позволяет сохранить последовательности, которые соответствуют определенным критериям, заданным пользователем.

source: The second method is a bit more complicated and requires us to understand the concept of process signals.
ru: Второй метод немного сложнее и требует от понимания концепции сигналов, передаваемых процессам.

source: The second one is phylogenetic analysis aimed at detecting the mutation distances between the OTUs.
ru: Второй - филогенетический анализ, направленный на определение расстояний между мутациями OTU.

source: The sffinfo command extract sequences reads from a .sff file.
ru: Команда sffinfo извлекает последовательности (прочтения) из файла .sff.

source: The shell will check the directories listed in the PATH variable for the script you are trying to find.
ru: Оболочка перебирает каталоги, перечисленные в переменной PATH, пытаясь найти программу, которую требуется запустить.

source: The signals traveling through the telephone wires your ISP owns are analog signals (wave frequencies), while your computer runs on digital signals (1s and 0s).
ru: Сигналы, проходящие по телефонной линии до вашего интернет-провайдера аналоговые, в то время как работа компьютера соответствует цифровой технологии передачи сигналов (единицы и нули).

source: The software realizes whole set of models of Model-Driven Architecture in the design process: from Computationally-Independed model of a domain of a technical system to the CLIPS and OWL2 sources of the knowledge base generation.
ru: Программное обеспечение реализует полный набор моделей MDA (Model-driven architecture) в процессе проектирования: начиная с вычислительно-независимой модели предметной области технической системы и заканчивая исходным кодом OWL2, а также в формате системы CLIPS.

source: The software will allow mathematicians to construct new aniintuitive decisions on manufacturing control strategies.
ru: Программное обеспечение позволит математикам строить новые антиинтуитивные решения над стратегиями управления производством.

source: The source model data are represented on the base of Semantic Web technologies.
ru: Данные исходной модели представлены на основе технологий семантической паутины.

source: The standard XMI representation is transformed into set of triples <subject, predicate, object> as an internal representation [2].
ru: Стандартное представление в формате XMI преобразуется в набор троек <субъект, предикат, объект> - это внутренне представление исходных данных [2].

source: The structures of the RWP representation are complex and comprises various aspects (projections).
ru: Структура моделей ЗРМ сложна и состоит из различных аспектов (проекций).

source: The summary data are represented as statistic criteria of minimal, maximal, average and four-quantile evaluations.
ru: Сводные данные представлены в виде статистических критериев минимальной, максимальной, средней и четырехквантильной оценки.

source: The summary page - for high level statistics about your computer
ru: Сводная страница - получение обобщенной статистики о работе компьютера

source: The supervisor can be built without the tolerance, i.e. to ensure precisely a predetermined specification for system behavior, and with the tolerance, i.e., to ensure that the behavior of the controlled system lies within specification.
ru: --- Супервизор модет быть построен [без толерантности], т.е. с обеспечением точно заданный спецификации на поведение системы, или с толерантностью, т.е., с гарантией, что поведение системы находится в пределах спецификации.

source: The supervisor ensures the implementation of a given specification when the language describing it is co-observable.
ru: Супервизор обеспечивает реализацию заданной спецификации, в случае, если язык, соответствующий ей является ко-наблюдаемым.

source: The syntax for an array is a bit weird in bash as you can see.
ru: Как видите, форма представления массивов в bash немного странная.

source: The syntax for looping in bash is:
ru: Синтаксис цикла в bash:

source: The synthesis is implementing one of methods (Teugu) of generative programming, transformation of models.
ru: Синтез реализует один из методов (Э. Тэугу) порождающего программирования - преобразование моделей.

source: The synthesized control should ensure that the system corresponds to a set of predefined constraints and/or maximizing/minimizing values of system characteristics.
ru: Синтезированное управление должно гарантировать, что система соответствует набору предопределенных ограничений и/или максимальным/минимальным значениям характеристик системы.

source: The system constructs the inference till dead time is reached.
ru: Система строит логический вывод, пока не достигается критическое время.

source: The system model is used to predict the future state of the system.
ru: Модель системы используется для прогнозирования будущего состояния системы.

source: The technique of the transformation is based on Model Driven Architecture principles and logical inference of the derived models and the code.
ru: Техника преобразования основана на принципах архитектуры, управляемой моделями (Model driven architecture), и логическом выводе производных моделей и исходного кода.

source: The technique will be used to construct transformation of SysML representation of RDDESU into an internal representation.
ru: Эта методика будет использоваться для программирования трансформаци SysML, представляющей РУДССН, во внутреннее представление систем имитационного моделирования.

source: The technologies we spoke before allow us to account the peculiarity of our problem, which is the requirement of a greater flexibility of the computation process and domain user experience adaptation.
ru: Вышеупомянутые технологии позволяют нам действовать в рамках наших задач, решение которых требуют большей гибкости процесса вычислений и адаптации опыта пользователья-предметника.

source: The testing syntax that we use for an if-then statement comes from the test command, and you can find all of the possibilities on the man page by typing man test.
ru: Форма представления выражений проверки исинности, которая используется в операторе if-then, базируется на команде test команду, ее детальная информация представлена в руководстве man test.

source: The theoretical results could be used to construct decision support systems for engineering manufacturing processes, assessment of the robustness of the synthesized control.
ru: Теоретические результаты могут быть использованы для построения систем поддержки принятия решений для проектирования процессов производства, оценки робастности синтезированного управления.
